{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 88, 8], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 124, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 124, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oDc3VtKQHaAXipAHIGAAAA+iNEOlxQcm9qZWN0c1xNZW1vcnlOZXR3b3JrXG1vZGVscy5w\nedoIPGxhbWJkYT5BAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oDc3VtKQHaAXipAHIGAAAA+iNEOlxQcm9qZWN0c1xNZW1vcnlOZXR3b3JrXG1vZGVscy5w\nedoIPGxhbWJkYT49AAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "reshape_5", "class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "target_shape": [1, 32]}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "dot_3", "class_name": "Dot", "config": {"name": "dot_3", "trainable": true, "axes": 2, "normalize": false}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["reshape_5", 0, 0, {}]]]}, {"name": "reshape_6", "class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "target_shape": [88]}, "inbound_nodes": [[["dot_3", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 124, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["reshape_6", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oDc3VtKQHaAXipAHIGAAAA+iNEOlxQcm9qZWN0c1xNZW1vcnlOZXR3b3JrXG1vZGVscy5w\nedoIPGxhbWJkYT5MAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "reshape_7", "class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "target_shape": [88, 1]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "dot_4", "class_name": "Dot", "config": {"name": "dot_4", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["reshape_7", 0, 0, {}], ["lambda_5", 0, 0, {}]]]}, {"name": "reshape_8", "class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "target_shape": [32]}, "inbound_nodes": [[["dot_4", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["reshape_8", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 32, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "reshape_9", "class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "target_shape": [1, 32]}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dot_5", "class_name": "Dot", "config": {"name": "dot_5", "trainable": true, "axes": 2, "normalize": false}, "inbound_nodes": [[["lambda_5", 0, 0, {}], ["reshape_9", 0, 0, {}]]]}, {"name": "reshape_10", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "target_shape": [88]}, "inbound_nodes": [[["dot_5", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["reshape_10", 0, 0, {}]]]}, {"name": "embedding_6", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 124, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "reshape_11", "class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "target_shape": [88, 1]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oDc3VtKQHaAXipAHIGAAAA+iNEOlxQcm9qZWN0c1xNZW1vcnlOZXR3b3JrXG1vZGVscy5w\nedoIPGxhbWJkYT5MAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"name": "dot_6", "class_name": "Dot", "config": {"name": "dot_6", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["reshape_11", 0, 0, {}], ["lambda_6", 0, 0, {}]]]}, {"name": "reshape_12", "class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "target_shape": [32]}, "inbound_nodes": [[["dot_6", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["reshape_12", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 32, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 124, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}